; domain
(define (domain grid_world ) 
(:requirements :strips :typing) 
(:types car
agent - car
gridcell
) 
(:predicates (at ?pt1 - gridcell ?car - car) 
(up_next ?pt1 - gridcell ?pt2 - gridcell) 
(down_next ?pt1 - gridcell ?pt2 - gridcell) 
(forward_next ?pt1 - gridcell ?pt2 - gridcell) 
(blocked ?pt1 - gridcell) 
) 
(:action up
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition (and (at ?agent ?pt1) (not (blocked ?pt2)) (up_next ?pt1 ?pt2) )
:effect (and (not (at ?agent ?pt1)) (at ?agent ?pt2))
) 
(:action down
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition (and (at ?agent ?pt1) (not (blocked ?pt2)) (down_next ?pt1 ?pt2) )
:effect (and (not (at ?agent ?pt1)) (at ?agent ?pt2))
) 
(:action forward
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition ( and (at ?agent ?pt1) (not (blocked ?pt2)) (forward_next ?pt1 ?pt2) )
:effect (and (not (at ?agent ?pt1)) (at ?agent ?pt2))
) 
)

; problem
(define (problem parking) 
 (:domain grid_world) 
(:objects agent1  - agent
 pt0pt0 pt0pt1 pt0pt2 pt1pt0 pt1pt1 pt1pt2 pt2pt0 pt2pt1 pt2pt2 pt3pt0 pt3pt1 pt3pt2 pt4pt0 pt4pt1 pt4pt2  - gridcell
 ) 
(:init (at agent1 pt4pt2) (blocked pt0pt2) (blocked pt1pt0) (blocked pt4pt1) (blocked pt0pt1) (blocked pt1pt2) (blocked pt3pt0) (up_next pt0pt0 pt4pt0) (up_next pt0pt1 pt4pt0) (up_next pt0pt2 pt4pt1) (up_next pt1pt0 pt0pt0) (up_next pt1pt1 pt0pt0) (up_next pt1pt2 pt0pt1) (up_next pt2pt0 pt1pt0) (up_next pt2pt1 pt1pt0) (up_next pt2pt2 pt1pt1) (up_next pt3pt0 pt2pt0) (up_next pt3pt1 pt2pt0) (up_next pt3pt2 pt2pt1) (up_next pt4pt0 pt3pt0) (up_next pt4pt1 pt3pt0) (up_next pt4pt2 pt3pt1) (down_next pt0pt0 pt4pt1) (down_next pt0pt1 pt4pt2) (down_next pt0pt2 pt4pt3) (down_next pt1pt0 pt0pt1) (down_next pt1pt1 pt0pt2) (down_next pt1pt2 pt0pt3) (down_next pt2pt0 pt1pt1) (down_next pt2pt1 pt1pt2) (down_next pt2pt2 pt1pt3) (down_next pt3pt0 pt2pt1) (down_next pt3pt1 pt2pt2) (down_next pt3pt2 pt2pt3) (down_next pt4pt0 pt3pt1) (down_next pt4pt1 pt3pt2) (down_next pt4pt2 pt3pt3) (forward_next pt0pt0 pt4pt0) (forward_next pt0pt1 pt4pt1) (forward_next pt0pt2 pt4pt2) (forward_next pt1pt0 pt0pt0) (forward_next pt1pt1 pt0pt1) (forward_next pt1pt2 pt0pt2) (forward_next pt2pt0 pt1pt0) (forward_next pt2pt1 pt1pt1) (forward_next pt2pt2 pt1pt2) (forward_next pt3pt0 pt2pt0) (forward_next pt3pt1 pt2pt1) (forward_next pt3pt2 pt2pt2) (forward_next pt4pt0 pt3pt0) (forward_next pt4pt1 pt3pt1) (forward_next pt4pt2 pt3pt2) ) 
(:goal (at agent1 pt0pt0)) 
)

; plan
1. (forward agent1 pt4pt2 pt3pt2)
   deleted: (at agent1 pt4pt2)
   added: (at agent1 pt3pt2)
   goals met: 0 of 1
2. (up agent1 pt3pt2 pt2pt1)
   deleted: (at agent1 pt3pt2)
   added: (at agent1 pt2pt1)
   goals met: 0 of 1
3. (forward agent1 pt2pt1 pt1pt1)
   deleted: (at agent1 pt2pt1)
   added: (at agent1 pt1pt1)
   goals met: 0 of 1
4. (up agent1 pt1pt1 pt0pt0)
   deleted: (at agent1 pt1pt1)
   added: (at agent1 pt0pt0)
   goals met: 1 of 1
